import { Translations } from "./en";

export const ar: Translations = {
    header: {
        nav: {
            about: "نبذة عني",
            projects: "المشاريع",
            contact: "تواصل معي",
        },
    },
    hero: {
        greeting: "مرحباً، أنا",
        name: "كيرلس خيري",
        title: "مطور واجهات أمامية مبتدئ",
        description:
            "مطور واجهات أمامية شغوف متخصص في إنشاء تطبيقات ويب جميلة ومتجاوبة وسهلة الاستخدام. أحول الأفكار إلى واقع من خلال كود نظيف ومبادئ تصميم حديثة.",
        downloadCV: "تحميل السيرة الذاتية",
        viewProjects: "عرض المشاريع",
        cvDownloadSuccess: "تم تحميل السيرة الذاتية بنجاح!",
    },
    about: {
        title: "نبذة عني",
        whoAmI: {
            title: "من أنا",
            paragraphs: [
                "أنا مهندس برمجيات شغوف متخصص في تطوير الواجهات الأمامية باستخدام React.js و Next.js. مع أساس قوي في مبادئ الهندسة وتقنيات الويب الحديثة، أقوم ببناء تطبيقات قابلة للتطوير ومتجاوبة وسهلة الاستخدام.",
                "يجمع نهجي بين الخبرة التقنية والعين الثاقبة للتصميم، مما يضمن أن التطبيقات التي أبنيها ليست فقط وظيفية ولكنها أيضاً توفر تجارب مستخدم استثنائية.",
                "من خلال التعلم المستمر والتعاون، أسعى جاهداً لإحياء الحلول المبتكرة، والمساهمة في نمو ونجاح التطبيقات التي أعمل عليها.",
                "مع التزام قوي بالجودة وشغف بالابتكار، أنا ملتزم بتقديم نتائج استثنائية تلبي احتياجات المستخدمين وأصحاب المصلحة.",
                "لنعمل معاً لإنشاء حلول برمجية استثنائية تدفع نجاح الأعمال.",
            ],
        },
        education: {
            title: "التعليم",
            items: [
                {
                    title: "تدريب حضوري",
                    role: "كمطور واجهات أمامية",
                    company: "في Zedny من ديسمبر 2025 إلى يناير 2026",
                    duration: "المدة: شهرين",
                },
                {
                    title: "تدريب عن بعد",
                    role: "كمطور واجهات أمامية",
                    company: "في DevWave من يوليو 2025 إلى أكتوبر 2025",
                    duration: "المدة: 3 أشهر",
                },
                {
                    title: "خريج DEPI (مبادرة رواد مصر الرقمية)",
                    company: "في DEPI من يناير 2025 إلى يونيو 2025",
                    duration: "المدة: شهرين",
                },
            ],
        },
    },
};
